; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p2---int100n150-m25---int100c110---s10---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level14 level14)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level14 level15)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level14 level16)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level14 level17)
(sum level3 level19 level22)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level14 level18)
(sum level4 level19 level23)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level14 level19)
(sum level5 level19 level24)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level14 level20)
(sum level6 level19 level25)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level14 level21)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level14 level22)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level14 level23)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level14 level24)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level14 level25)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level7 level24)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level7 level25)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level22 level3 level25)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l0 l3)
(fuelcost level3 l0 l3)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)
(connected l2 l3)
(fuelcost level14 l2 l3)
(connected l2 l4)
(fuelcost level19 l2 l4)
(connected l3 l0)
(fuelcost level3 l3 l0)
(connected l3 l2)
(fuelcost level14 l3 l2)
(connected l3 l4)
(fuelcost level7 l3 l4)
(connected l4 l2)
(fuelcost level19 l4 l2)
(connected l4 l3)
(fuelcost level7 l4 l3)

(at t0 l2)
(fuel t0 level25)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
)

(:goal
(and
(at p0 l3)
(at p1 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 2
2. (drive t0 l2 l1 level16 level9 level25)
   deleted: (at t0 l2) (fuel t0 level25)
   added: (at t0 l1) (fuel t0 level16)
   goals met: 0 of 2
3. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 1 of 2
4. (drive t0 l1 l2 level7 level9 level16)
   deleted: (at t0 l1) (fuel t0 level16)
   added: (at t0 l2) (fuel t0 level7)
   goals met: 1 of 2
5. (drive t0 l2 l0 level3 level4 level7)
   deleted: (at t0 l2) (fuel t0 level7)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 1 of 2
6. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 1 of 2
7. (drive t0 l0 l3 level0 level3 level3)
   deleted: (at t0 l0) (fuel t0 level3)
   added: (at t0 l3) (fuel t0 level0)
   goals met: 1 of 2
8. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 2 of 2
